In [2]:
import pandas as pd
from pandas import Series, DataFrame

In [4]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index  # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [10]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [14]:
#创建对各个数据点进行标记的索引
obj_index = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj_index

d    4
b    7
a   -5
c    3
dtype: int64

In [15]:
obj_index.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [22]:
#与普通 NumPy 数组相比，你可以通过索引的方式选取 Series 中的单个或一组值
obj_index['b']

7

In [20]:
obj_index[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [23]:
#使用 NumPy 函数或类似 NumPy 的运算(如根据布尔型数组进行过滤、标量乘 法、应用数学函数等)都会保留索引值的链接
obj_index[obj_index > 0]

d    4
b    7
c    3
dtype: int64

In [24]:
obj_index*2

d     8
b    14
a   -10
c     6
dtype: int64

In [26]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000,
'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [28]:
#传入排好序的字典的键以改变顺序
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [29]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [30]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [31]:
#建立 DataFrame
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada','Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
#Jupyter notebook中，pandas DataFrame 对象会以对浏览器友好 的 HTML 表格的方式呈现
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [32]:
#指定了列序列  DataFrame 的列就会按照指定顺序进行排列
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [33]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop',
'debt'],index=['one', 'two', 'three', 'four',
       'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [34]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [35]:
#通过类似字典标记的方式或属性的方式，可以将 DataFrame 的列获取为一个 Series
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [36]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four',
'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [37]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [39]:
frame2['debt_null'] = frame2.debt.isnull()
frame2

       year   state  pop  debt  eastern  debt_null
one    2000    Ohio  1.5   NaN     True       True
two    2001    Ohio  1.7  -1.2     True      False
three  2002    Ohio  3.6   NaN     True       True
four   2001  Nevada  2.4  -1.5    False      False
five   2002  Nevada  2.9  -1.7    False      False
six    2003  Nevada  3.2   NaN    False       True

In [40]:
del frame2['eastern']
frame2

       year   state  pop  debt  debt_null
one    2000    Ohio  1.5   NaN       True
two    2001    Ohio  1.7  -1.2      False
three  2002    Ohio  3.6   NaN       True
four   2001  Nevada  2.4  -1.5      False
five   2002  Nevada  2.9  -1.7      False
six    2003  Nevada  3.2   NaN       True

In [47]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
#内层字典的键会被合并、排序以形成最终的索引
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [44]:
#转置(交换行和列)
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [65]:
#如果明确指定索引
#pd.DataFrame(pop)
pop2 = {'Nevada': {2001: 2.4, 2002: 2.9,2003:3.6},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
#frame_3 =pd.DataFrame(pop2)
frame_3 = pd.DataFrame(pop2, pd.Index([2001, 2002,2003]))
frame_3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     3.6   NaN

In [56]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4